package woowacourse.movie.util

import woowacourse.movie.domain.movie.Movie
import java.time.LocalDate

object DummyData {
    val movies = listOf(
        Movie.of(
            "해리포터와 마법사의 돌 1",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 2",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 3",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 4",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 5",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 6",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
        Movie.of(
            "해리포터와 마법사의 돌 7",
            LocalDate.of(2023, 3, 1),
            LocalDate.of(2023, 3, 31),
            152,
            "《해리 포터와 마법사의 돌》은 2001년 J. K. 롤링의 동명 소설을 원작으로 하여 만든, 영국과 미국 합작, 판타지 영화이다. 해리포터 시리즈 영화 8부작 중 첫 번째에 해당하는 작품이다. 크리스 콜럼버스가 감독을 맡았다."
        ),
    )
}
